import type { MarriStatus } from "@/types/home"

// 民族
export const nationArr = [
  '汉族', '壮族', '满族', '回族',
  '苗族', '维吾尔族', '土家族', '彝族',
  '蒙古族', '藏族', '布依族', '侗族',
  '瑶族', '朝鲜族', '白族', '哈尼族',
  '哈萨克族', '黎族', '傣族', '畲族',
  '傈僳族', '仡佬族', '东乡族', '高山族',
  '拉祜族', '水族', '佤族', '纳西族',
  '羌族', '土族', '仫佬族', '锡伯族',
  '柯尔克孜族', '达斡尔族', '景颇族', '毛南族',
  '撒拉族', '布朗族', '塔吉克族', '阿昌族',
  '普米族', '鄂温克族', '怒族', '京族',
  '基诺族', '德昂族', '保安族', '俄罗斯族',
  '裕固族', '乌孜别克族', '门巴族', '鄂伦春族',
  '独龙族', '塔塔尔族', '赫哲族', '珞巴族'
]

export const householdArr = ['户主', '配偶', '儿子', '女儿', '父亲', '母亲', '其他']
// 政治面貌简版
export const politicalArr = [
  { label: '中共党员', value: 1 },
  { label: '群众', value: 2 },
  { label: '其他', value: 3 },
]
// 户籍性质
export const residenceArr = ['城镇', '农村']
// 婚姻状况
export const marriageArr = ['未婚', '已婚', '离异', '丧偶']
// 学历
export const eduArr = ['文盲/半文盲', '小学', '初中', '高中', '专科', '本科', '研究生', '其他']
// 宗教信仰
export const religionArr = ['无', '道教', '佛教', '基督教', '伊斯兰教', '其他', '邪教']
// 标签
export const tagsArr = ['低保', '特困', '残疾人', '空巢老人', '留守儿童', '退役军人', '信访人员', '']
